app/controllers/articles_controller.rb

  def create
     @article = Article.new(ghost)
    if @article.save
---
INSERT INTO "articles" ("name", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "himesh"], ["created_at", "2021-06-23 05:53:45.202818"], ["updated_at", "2021-06-23 05:53:45.202818"], ["email", "himesh@gmail.com"]]

  def update
  p 111111111111111111111111
  @article = Article.find(params[:id])

    if @article.update(ghost)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "name" = $1, "updated_at" = $2, "email" = $3 WHERE "articles"."id" = $4  [["name", "vijay"], ["updated_at", "2021-06-23 09:58:59.986846"], ["email", "vijay@gmail.com"], ["id", 10]]

  def show
    @data = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def destroy
    @destroy = Article.find(params[:id])
    @destroy.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 17]]